=== Vocabulary Coverage Report ===
Sources: CUSTOM(all-words.csv):3283
Total vocab entries (expanded tokens): 3283

[Per Passage]
  - advanced-1.txt: tokens=590 match=566 coverage=17.24%
  - advanced-2.txt: tokens=588 match=563 coverage=17.15%
  - advanced-3.txt: tokens=375 match=229 coverage=6.98%
  - beginner-1.txt: tokens=293 match=279 coverage=8.50%
  - beginner-2.txt: tokens=398 match=349 coverage=10.63%
  - beginner-3.txt: tokens=399 match=344 coverage=10.48%
  - intermediate-1.txt: tokens=470 match=448 coverage=13.65%
  - intermediate-2.txt: tokens=479 match=460 coverage=14.01%
  - intermediate-3.txt: tokens=421 match=402 coverage=12.24%
  - intermediate-4.txt: tokens=312 match=292 coverage=8.89%

Total used vocab tokens: 2817
Total unused vocab tokens: 466
Overall coverage: 85.81%

[Top 200 Unused Tokens]
  a.m.
  accident
  according
  action
  actually
  affection​ate
  against
  ahead
  aid
  airport
  angry
  anymore
  anything
  anyway
  april
  apron
  asian
  banana
  baseball
  bath
  bathroom
  bean
  beauty
  bedroom
  bee
  behavior
  bench
  bicycle
  bike
  bomb
  boring
  born
  bottom
  bowl
  brain
  bridge
  brown
  brush
  building
  business
  busy
  bye
  cabbage
  cafe
  camping
  canada
  candy
  cap
  carrot
  chance
  cheer
  chicken
  choice
  choose
  christmas
  classmate
  classroom
  clock
  cloudy
  cookie
  couple
  cow
  culture
  curtain
  customer
  dance
  dangerous
  dear
  death
  decision
  delivery
  dessert
  destroy
  dictionary
  disagree
  disappear
  disaster
  discover
  disease
  dish
  dive
  dollar
  domestic
  double
  drama
  drill
  earn
  earthquake
  easily
  egg
  eighteen
  eighth
  eighty
  electricity
  elementary
  elephant
  eleventh
  empty
  encourage
  ending
  english
  eraser
  establish
  european
  everything
  everywhere
  exactly
  exam
  exception
  excuse
  expensive
  expression
  factory
  fan
  fantastic
  farmer
  favorite
  feather
  feature
  february
  fee
  feed
  feeling
  fever
  fiction
  fifteen
  fifth
  fifty
  file
  finally
  firework
  fishing
  flight
  fold
  football
  foreigh
  forever
  fortunately
  forty
  fourteen
  fourth
  france
  freedom
  freely
  fresh
  friday
  friendly
  frog
  funny
  further
  garbage
  germany
  gesture
  giant
  gift
  glad
  global
  gold
  goods
  gorilla
  graduate
  grandfather
  grandma
  grandpa
  grandparent
  grapes
  greatly
  guest
  guitar
  hair
  hall
  hamberger
  handle
  headache
  hello
  heritage
  hero
  hers
  herself
  hi
  hide
  himself
  hit
  hobby
  hole
  holiday
  hometown
  hopeful
  horror
  host
  hotel
  hug
  huge
  hunt
  hurt
  husband
  imagine
  impossible
  india
  injure