=== Vocabulary Coverage Report ===
Sources: BASE:2662, INTERMEDIATE(+1579)
Total vocab entries (expanded tokens): 3286

[Per Passage]
  - advanced-1.txt: tokens=590 match=566 coverage=17.22%
  - advanced-2.txt: tokens=588 match=563 coverage=17.13%
  - advanced-3.txt: tokens=46 match=39 coverage=1.19%
  - beginner-1.txt: tokens=293 match=279 coverage=8.49%
  - beginner-2.txt: tokens=309 match=293 coverage=8.92%
  - beginner-3.txt: tokens=309 match=292 coverage=8.89%
  - intermediate-1.txt: tokens=470 match=448 coverage=13.63%
  - intermediate-2.txt: tokens=479 match=460 coverage=14.00%
  - intermediate-3.txt: tokens=421 match=402 coverage=12.23%
  - intermediate-4.txt: tokens=312 match=292 coverage=8.89%

Total used vocab tokens: 2690
Total unused vocab tokens: 596
Overall coverage: 81.86%

[Top 200 Unused Tokens]
  a.m.
  abroad
  accident
  according
  action
  actually
  affection​ate
  against
  ahead
  aid
  airplane
  airport
  amazing
  america
  american
  amount
  angry
  animated
  announcement
  anymore
  anyone
  anything
  anyway
  april
  apron
  aquarium
  area
  around
  asian
  august
  australia
  awesome
  baby
  bacon
  badminton
  baker
  banana
  baseball
  basketball
  bath
  bathroom
  beach
  bean
  beautiful
  beauty
  bedroom
  bee
  beef
  beginner
  behavior
  beke
  bench
  beyond
  bicycle
  bike
  birthday
  bit
  bomb
  bookstore
  bored
  boring
  born
  borrow
  bottle
  bottom
  bowl
  brain
  brazil
  breakfast
  bridge
  bright
  brown
  brush
  building
  business
  busy
  bye
  cabbage
  cafe
  cafeteria
  cake
  calligraphy
  camping
  canada
  cancer
  candy
  cap
  carefully
  carrot
  castle
  certainly
  challenge
  chance
  cheer
  cheese
  chef
  chicken
  china
  chinese
  choose
  christmas
  church
  classmate
  classroom
  clearly
  clock
  cloudy
  club
  colorful
  cookie
  cooking
  countryside
  couple
  courage
  court
  cousin
  cow
  creative
  crowd
  crowded
  cucumber
  cultural
  culture
  curry
  curtain
  custom
  customer
  cute
  damage
  dance
  dancing
  dangerous
  deal
  dear
  death
  debate
  december
  decision
  decorate
  decrease
  delicious
  delivery
  dentist
  depend
  desigh
  designer
  dessert
  destroy
  development
  dictionary
  difference
  dinner
  direction
  dirty
  disagree
  disappear
  disaster
  discover
  discussion
  disease
  dish
  display
  dive
  dollar
  domestic
  double
  drama
  drill
  driver
  drum
  earn
  earthquake
  easily
  effective
  egg
  eighteen
  eighth
  eighty
  elderly
  electricity
  electronic
  elementary
  elephant
  eleventh
  emergency
  empty
  encourage
  endangered
  ending
  energy
  english
  eraser
  establish
  european
  evacuation
  even
  everybody
  everything
  everywhere
  exactly