=== Vocabulary Coverage Report ===
Sources: BASE:2662, INTERMEDIATE(+1578)
Total vocab entries (expanded tokens): 3281

[Per Passage]
  - advanced-family-gathering.txt: tokens=1229 match=577 coverage=17.59%
  - advanced-health-statistics.txt: tokens=947 match=374 coverage=11.40%
  - advanced-international-exchange.txt: tokens=1069 match=487 coverage=14.84%
  - advanced-school-festival.txt: tokens=1285 match=587 coverage=17.89%
  - advanced-summer-vacation-stories.txt: tokens=974 match=463 coverage=14.11%
  - beginner-cafe-menu.txt: tokens=314 match=187 coverage=5.70%
  - beginner-conversation-daily.txt: tokens=536 match=380 coverage=11.58%
  - beginner-wildlife-park-guide.txt: tokens=553 match=268 coverage=8.17%
  - intermediate-community-events.txt: tokens=599 match=291 coverage=8.87%
  - intermediate-exchange-student-australia.txt: tokens=789 match=410 coverage=12.50%
  - intermediate-homestay-america.txt: tokens=771 match=454 coverage=13.84%
  - intermediate-school-events-year.txt: tokens=688 match=348 coverage=10.61%
  - intermediate-school-news.txt: tokens=586 match=285 coverage=8.69%

Total used vocab tokens: 1516
Total unused vocab tokens: 1765
Overall coverage: 46.21%

[Top 200 Unused Tokens]
  a.m.
  absent
  absorb
  abstract
  absurd
  abundance
  academy
  accelerate
  accent
  acceptable
  acceptance
  accessory
  accidental
  accompaniment
  accompany
  accord
  accordance
  accordingly
  account
  accuracy
  accurate
  accusation
  accuse
  accustomed
  ache
  acid
  acquaint
  acquaintance
  acquire
  acre
  activate
  actress
  acute
  adapt
  adaptation
  addict
  addition
  adequate
  adhere
  adjacent
  adjective
  adjust
  administer
  admirable
  admiral
  admiration
  adolescent
  adopt
  adore
  adorn
  adult
  advantage
  advent
  advertise
  advertisement
  advise
  adviser
  advocate
  aerial
  aesthetic
  affair
  affection
  affection​ate
  affirm
  afflict
  affluent
  afloat
  against
  agent
  aggravate
  aggregate
  aggressive
  agitate
  agony
  agreeable
  agriculture
  aircraft
  aisle
  alarm
  alas
  algebra
  alien
  align
  alike
  allege
  allergic
  allergy
  alleviate
  alliance
  allowance
  alloy
  ally
  alphabet
  alter
  alternate
  alternative
  although
  altitude
  altogether
  aluminum
  amateur
  amaze
  ambassador
  ambiguous
  ambition
  ambulance
  amend
  amid
  ammunition
  ample
  amplify
  amuse
  amusement
  analogy
  ancestor
  anchor
  anew
  angel
  angle
  angry
  anguish
  animate
  ankle
  anniversary
  announce
  annoy
  ant
  anticipate
  antique
  anxious
  anybody
  anyhow
  apartment
  apologize
  apology
  apparatus
  apparent
  appeal
  appetite
  applaud
  appliance
  applicable
  applicant
  apply
  appoint
  appointment
  apprehension
  apprentice
  appropriate
  approval
  approve
  approximate
  apron
  apt
  aquarium
  arbitrary
  arc
  arch
  architect
  archive
  arctic
  ardent
  arduous
  arena
  argument
  arise
  aristocrat
  arithmetic
  arm
  armor
  arouse
  arrangement
  array
  arrest
  arrow
  artist
  artistic
  ascend
  ascertain
  ashamed
  asian
  aside
  aspect
  aspiration
  assault
  assemble
  assert
  assess
  assessment
  asset
  assign
  assist
  assistant
  associate
  assorted
  assume
  assumption
  assurance
  assure
  astonish